In [5]:
import pandas as pd

In [6]:
dates = pd.date_range('20211123', periods=7)

In [7]:
dates

DatetimeIndex(['2021-11-23', '2021-11-24', '2021-11-25', '2021-11-26',
               '2021-11-27', '2021-11-28', '2021-11-29'],
              dtype='datetime64[ns]', freq='D')

In [8]:
import numpy as np

In [9]:
df = pd.DataFrame(np.random.randn(7,4), index=dates, columns=['A','B','C','D'])

In [10]:
df

                   A         B         C         D
2021-11-23  1.417342  0.460488 -1.079789  0.015701
2021-11-24  1.144189 -0.188584  1.791756  1.973901
2021-11-25 -0.837799 -0.512604 -1.143139 -0.597971
2021-11-26 -1.933286 -0.241203  1.209899  1.355464
2021-11-27  1.846411 -0.042170  0.042815  0.596193
2021-11-28 -0.134647  1.176669  1.007305  0.333062
2021-11-29  0.274540 -1.733211  0.038520  0.305716

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df.index

DatetimeIndex(['2021-11-23', '2021-11-24', '2021-11-25', '2021-11-26',
               '2021-11-27', '2021-11-28', '2021-11-29'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.values

array([[ 1.41734169,  0.4604877 , -1.07978913,  0.01570132],
       [ 1.14418883, -0.18858391,  1.79175561,  1.97390114],
       [-0.83779887, -0.51260405, -1.14313946, -0.59797143],
       [-1.93328577, -0.24120292,  1.20989923,  1.35546431],
       [ 1.8464107 , -0.04216961,  0.04281499,  0.59619268],
       [-0.1346471 ,  1.17666901,  1.00730533,  0.33306217],
       [ 0.27453963, -1.73321085,  0.03851968,  0.30571606]])

In [15]:
df.describe()

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean   0.253821 -0.154374  0.266767  0.568867
std    1.342217  0.893689  1.130397  0.854981
min   -1.933286 -1.733211 -1.143139 -0.597971
25%   -0.486223 -0.376903 -0.520635  0.160709
50%    0.274540 -0.188584  0.042815  0.333062
75%    1.280765  0.209159  1.108602  0.975828
max    1.846411  1.176669  1.791756  1.973901

In [16]:
df.sort_values(by='A')

                   A         B         C         D
2021-11-26 -1.933286 -0.241203  1.209899  1.355464
2021-11-25 -0.837799 -0.512604 -1.143139 -0.597971
2021-11-28 -0.134647  1.176669  1.007305  0.333062
2021-11-29  0.274540 -1.733211  0.038520  0.305716
2021-11-24  1.144189 -0.188584  1.791756  1.973901
2021-11-23  1.417342  0.460488 -1.079789  0.015701
2021-11-27  1.846411 -0.042170  0.042815  0.596193

In [17]:
df.sort_values(by='A', ascending=False)

                   A         B         C         D
2021-11-27  1.846411 -0.042170  0.042815  0.596193
2021-11-23  1.417342  0.460488 -1.079789  0.015701
2021-11-24  1.144189 -0.188584  1.791756  1.973901
2021-11-29  0.274540 -1.733211  0.038520  0.305716
2021-11-28 -0.134647  1.176669  1.007305  0.333062
2021-11-25 -0.837799 -0.512604 -1.143139 -0.597971
2021-11-26 -1.933286 -0.241203  1.209899  1.355464

In [18]:
df['A']

2021-11-23    1.417342
2021-11-24    1.144189
2021-11-25   -0.837799
2021-11-26   -1.933286
2021-11-27    1.846411
2021-11-28   -0.134647
2021-11-29    0.274540
Freq: D, Name: A, dtype: float64

In [19]:
type(df['A'])

pandas.core.series.Series

In [20]:
df[0:3]

                   A         B         C         D
2021-11-23  1.417342  0.460488 -1.079789  0.015701
2021-11-24  1.144189 -0.188584  1.791756  1.973901
2021-11-25 -0.837799 -0.512604 -1.143139 -0.597971

In [21]:
df.loc['2021-11-23']

A    1.417342
B    0.460488
C   -1.079789
D    0.015701
Name: 2021-11-23 00:00:00, dtype: float64

In [22]:
df.loc['2021-11-23','A']

1.4173416868207978

In [23]:
df.loc['2021-11-23',['A','C']]

A    1.417342
C   -1.079789
Name: 2021-11-23 00:00:00, dtype: float64

In [24]:
df.loc['2021-11-23':'2021-11-24',['A','B']]

                   A         B
2021-11-23  1.417342  0.460488
2021-11-24  1.144189 -0.188584

In [25]:
df.loc[:,['A','B']]

                   A         B
2021-11-23  1.417342  0.460488
2021-11-24  1.144189 -0.188584
2021-11-25 -0.837799 -0.512604
2021-11-26 -1.933286 -0.241203
2021-11-27  1.846411 -0.042170
2021-11-28 -0.134647  1.176669
2021-11-29  0.274540 -1.733211

In [26]:
df.iloc[0:2]
# 숫자로 출력하기?

                   A         B         C         D
2021-11-23  1.417342  0.460488 -1.079789  0.015701
2021-11-24  1.144189 -0.188584  1.791756  1.973901

In [27]:
df.iloc[0:2,0:2]
# 행과 열에서 2줄만 출력하기

                   A         B
2021-11-23  1.417342  0.460488
2021-11-24  1.144189 -0.188584

In [28]:
df.iloc[[0,1,5],0:2]
# 0,1,5번째 행과 2열만 출력하기

                   A         B
2021-11-23  1.417342  0.460488
2021-11-24  1.144189 -0.188584
2021-11-28 -0.134647  1.176669

In [29]:
df['A']>0

2021-11-23     True
2021-11-24     True
2021-11-25    False
2021-11-26    False
2021-11-27     True
2021-11-28    False
2021-11-29     True
Freq: D, Name: A, dtype: bool

In [30]:
df[df['A']>0]
# A값중 0보다 큰값만 출력

                   A         B         C         D
2021-11-23  1.417342  0.460488 -1.079789  0.015701
2021-11-24  1.144189 -0.188584  1.791756  1.973901
2021-11-27  1.846411 -0.042170  0.042815  0.596193
2021-11-29  0.274540 -1.733211  0.038520  0.305716

In [31]:
df>0
# 0보다 큰값들은 true 아니면 false

                A      B      C      D
2021-11-23   True   True  False   True
2021-11-24   True  False   True   True
2021-11-25  False  False  False  False
2021-11-26  False  False   True   True
2021-11-27   True  False   True   True
2021-11-28  False   True   True   True
2021-11-29   True  False   True   True

In [32]:
df[df>0]
# 0보다 큰값들만 출력

                   A         B         C         D
2021-11-23  1.417342  0.460488       NaN  0.015701
2021-11-24  1.144189       NaN  1.791756  1.973901
2021-11-25       NaN       NaN       NaN       NaN
2021-11-26       NaN       NaN  1.209899  1.355464
2021-11-27  1.846411       NaN  0.042815  0.596193
2021-11-28       NaN  1.176669  1.007305  0.333062
2021-11-29  0.274540       NaN  0.038520  0.305716

In [33]:
df2 = pd.DataFrame(df, columns=['A','C','D','B'])
df2
# 순서도 간단히 바꿔줄수있음

                   A         C         D         B
2021-11-23  1.417342 -1.079789  0.015701  0.460488
2021-11-24  1.144189  1.791756  1.973901 -0.188584
2021-11-25 -0.837799 -1.143139 -0.597971 -0.512604
2021-11-26 -1.933286  1.209899  1.355464 -0.241203
2021-11-27  1.846411  0.042815  0.596193 -0.042170
2021-11-28 -0.134647  1.007305  0.333062  1.176669
2021-11-29  0.274540  0.038520  0.305716 -1.733211

In [34]:
df['E'] = np.nan
df
# NaN 값을가진 새로운 행E 붙임

                   A         B         C         D   E
2021-11-23  1.417342  0.460488 -1.079789  0.015701 NaN
2021-11-24  1.144189 -0.188584  1.791756  1.973901 NaN
2021-11-25 -0.837799 -0.512604 -1.143139 -0.597971 NaN
2021-11-26 -1.933286 -0.241203  1.209899  1.355464 NaN
2021-11-27  1.846411 -0.042170  0.042815  0.596193 NaN
2021-11-28 -0.134647  1.176669  1.007305  0.333062 NaN
2021-11-29  0.274540 -1.733211  0.038520  0.305716 NaN

In [35]:
df.loc['2021-11-24','E']=2
df
# E행의 '2021-11-24' 행에 값 2를 대입함

                   A         B         C         D    E
2021-11-23  1.417342  0.460488 -1.079789  0.015701  NaN
2021-11-24  1.144189 -0.188584  1.791756  1.973901  2.0
2021-11-25 -0.837799 -0.512604 -1.143139 -0.597971  NaN
2021-11-26 -1.933286 -0.241203  1.209899  1.355464  NaN
2021-11-27  1.846411 -0.042170  0.042815  0.596193  NaN
2021-11-28 -0.134647  1.176669  1.007305  0.333062  NaN
2021-11-29  0.274540 -1.733211  0.038520  0.305716  NaN

In [36]:
df['F']=df['A']+df['B']
df
# A행과 B행을 더하여 F칼럼에 추가하여 df에 붙임

                   A         B         C         D    E         F
2021-11-23  1.417342  0.460488 -1.079789  0.015701  NaN  1.877829
2021-11-24  1.144189 -0.188584  1.791756  1.973901  2.0  0.955605
2021-11-25 -0.837799 -0.512604 -1.143139 -0.597971  NaN -1.350403
2021-11-26 -1.933286 -0.241203  1.209899  1.355464  NaN -2.174489
2021-11-27  1.846411 -0.042170  0.042815  0.596193  NaN  1.804241
2021-11-28 -0.134647  1.176669  1.007305  0.333062  NaN  1.042022
2021-11-29  0.274540 -1.733211  0.038520  0.305716  NaN -1.458671

In [37]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\toyha\anaconda3\lib\site-packages (2.0.1)

In [38]:
pd.read_excel("./day1/data/teen.xls")
# ./ 뜻은 현재 디렉토리 라는뜻!

,기간,구분,스트레스 인지율,스트레스 인지율.1,스트레스 인지율.2,우울감 경험률,우울감 경험률.1,우울감 경험률.2,자살 생각률,자살 생각률.1,자살 생각률.2
0,기간,구분,전체,남학생,여학생,전체,남학생,여학생,전체,남학생,여학생
1,2020,구분,35.1,29.8,40.8,25.4,21.2,29.9,11.2,8.8,13.8

In [39]:
pd.read_excel("./day1/data/teen.xls", header=1)

     기간 구분     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  2020  구분  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [40]:
pd.read_excel("./day1/data/teen.xls", header=1, usecols="C:K")

     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [47]:
col_names=['스트레스', '스트레스남학생', '스트레스여학생', '우울감경험율', '우울남학생', '우울여학생', '자살생각율', '자살남학생','자살여학생']

pd.read_excel("./day1/data/teen.xls", header=1, usecols="C:K", names=col_names)

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [48]:
raw_data = pd.read_excel("./day1/data/teen.xls", header=1, usecols="C:K", names=col_names)
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [49]:
raw_data.loc[1] = 100 - raw_data.loc[0]
raw_data
# 1번 인덱스값을 100에서 빼어서 추가해줌!

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8
1  64.9     70.2     59.2    74.6   78.8   70.1   88.8   91.2   86.2

In [50]:
raw_data['응답']=['그렇다','아니다']
raw_data.set_index('응답',drop=True, inplace=True)

In [51]:
raw_data
# 첫번째 행을 응답, 그렇다, 아니다 로 바꾸어줌!

     스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
응답
그렇다  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8
아니다  64.9     70.2     59.2    74.6   78.8   70.1   88.8   91.2   86.2